# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [19]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [20]:
first = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
second = pd.Series(np.random.randint(1, high=3, size=100, dtype='l'))
third = pd.Series(np.random.randint(10000, high=30000, size=100, dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [21]:
df = pd.concat([first,second,third],axis=1)
df

    0  1      2
0   1  2  22007
1   3  1  13962
2   1  1  26095
3   3  2  14368
4   1  2  13245
.. .. ..    ...
95  2  1  23872
96  2  2  13109
97  2  2  16427
98  3  1  21342
99  2  1  14040

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [18]:
df.rename(columns = {0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       1       1            27338
1       1       1            16471
2       1       1            21884
3       3       2            13219
4       2       2            26481
..    ...     ...              ...
95      2       1            24546
96      3       2            12735
97      2       1            24892
98      2       1            23282
99      1       1            16419

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [28]:
bigcolumn = pd.concat([first,second,third],axis = 0)
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       1
1       3
2       1
3       3
4       1
..    ...
95  23872
96  13109
97  16427
98  21342
99  14040

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [34]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [33]:
bigcolumn.reset_index(drop = True,inplace = True)

         0
0        1
1        3
2        1
3        3
4        1
..     ...
295  23872
296  13109
297  16427
298  21342
299  14040

[300 rows x 1 columns]